# St7SetWindowImageLocation

Sets the location of the image used for bgImage and bgImageGradient background modes.

long St7SetWindowImageLocation(long uID, long ImageLocation)

Input Parameters

uID

Strand7 model file ID.

ImageLocation

One of ilCentre, ilTile, ilStretch, ilTopLeft, ilTopRight, ilBottomLeft, ilBottomRight.